doc/reliability.tex
% Created 2016-03-11 Fri 23:07
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\date{\today}
\title{(n+1)sec protocol over unreliable no global order chat protocols}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.5.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents

\section{transport assumption:}
\label{sec-1}
\subsection{the transport is unreliable in the sense that some messages might not arrive.}
\label{sec-1-1}
\subsection{the transport does not have a global order in the sense that some participants see messages in different orders}
\label{sec-1-2}

\section{Reliability and order during key agreement}
\label{sec-2}
\begin{itemize}
\item If only some of  participants does not receive a session establishment session, they will complain by asking for the sender to be kicked out of the conversion, in response those who received the corresponding message will re-transmit the missed message.
\item Message order is only important during the join process when the joiner sends its share. If two current participants have different view about which joiner has send their key first then they will go with a session with smaller hash value.
\end{itemize}

\section{Reliability during a session:}
\label{sec-3}
\begin{itemize}
\item If a participant does not acknowledge a message the sender will resend it.
\item When the transport is unreliable, the transport protocol build a partial order and compute the global order based on collapsing the partial order using time of arrival.
\item If global order differs among participants we reshuffle messages based on their hash to reach consistent order between participants.
\end{itemize}
% Emacs 24.5.1 (Org mode 8.2.10)
\end{document}
